"""
Задача 2.
Послідовність складається з натуральних чисел і завершується числом 0. Визначте
індекс найбільшого елемента послідовності. Якщо найбільших елементів декілька,
виведіть індекс першого з них. Нумерація елементів починається з нуля. Вводиться
послідовність цілих чисел, що закінчується числом 0 (саме число 0 в
послідовність не входить, а використовується як ознака її закінчення).

Автор: Волочнюк Поліна
"""

max_index = 0
max_value = 0
index = 0

while True:
    number = int(input("Введіть число (або 0 для завершення): "))
    if number == 0:
        break
    if number > max_value:
        max_value = number
        max_index = index
    
    index += 1
    
print(max_index)
